package com.cxhd.freight;

/**
 * Created by Li on 2016/1/14.
 */
public class AppConfig {
        //用户登陆状态
        private static Boolean USER_WHETHER_LANDING = false;
        //通信令牌
        public static String SERVICE_TOKEN = "7d76f956d07a9843bf53610ddecf294d";
        public static String SERVICE_SHAKEY = "sdfsdlfsfisfkcxsf97s9f7s97fs9df";
        //SESSION
        private static String SERVICE_SESSION = "";
        //正式服务器链接地址
        public static String HTTP_LINK1 = "http://115.28.30.53/service";
        //测试服务器链接地址
        public static String HTTP_LINK = "http://120.27.97.129/service";
        //货物类型列表
        public static String[] goods_type_lst = {"设备", "矿产", "建材", "食品", "蔬菜", "生鲜", "药品", "化工", "木材", "家畜", "纺织品", "日用品", "电子电器", "农副产品", "其他类型"};
        //车辆长度列表
        public static String[] car_length_lst = {"4.2","4.8","5.2","5.8","6.2","6.5","6.8","7.2","8","9.6","12","13","13.5","15","16.5","17.5","18.5","20","22","24"};
        //车辆类型列表
        public static String[] car_type_lst = {"厢式车","平板车","高低板车","高栏车","中栏车","低栏车","罐式车","冷藏车","保温车","危险品车","铁笼车","集装箱","自卸货车","其它车型"};
        //省级数组
        public static String[] set_province_lst = {"北京", "上海", "天津", "重庆", "河北", "山西", "内蒙古", "辽宁", "吉林", "黑龙江", "江苏", "浙江", "安徽", "福建", "江西", "山东", "河南", "湖北", "湖南", "广东", "广西", "海南", "四川", "贵州", "云南", "西藏", "陕西", "甘肃", "宁夏", "青海", "新疆"};
        //市级数组
        public static String[][] set_city_lst = { {"全境"},{"全境"},{"全境"},
                {"重庆", "万州", "涪陵", "渝中", "大渡口", "江北", "沙坪坝", "九龙坡", "南岸", "北碚", "万盛", "双挢", "渝北", "巴南", "黔江", "长寿", "綦江", "潼南", "铜梁", "大足", "荣昌", "壁山", "梁平", "城口", "丰都", "垫江", "武隆", "忠县","开县", "云阳", "奉节", "巫山", "巫溪", "石柱", "秀山", "酉阳", "彭水", "江津", "合川", "永川", "南川"},
                {"石家庄", "邯郸", "邢台", "保定", "张家口", "承德", "廊坊", "唐山", "秦皇岛", "沧州", "衡水"},
                {"太原", "大同", "阳泉", "长治", "晋城", "朔州", "吕梁", "忻州", "晋中", "临汾", "运城"},
                {"呼和浩特", "包头", "乌海", "赤峰", "呼伦贝尔盟", "阿拉善盟", "哲里木盟", "兴安盟", "乌兰察布盟", "锡林郭勒盟", "巴彦淖尔盟", "伊克昭盟"},
                {"沈阳", "大连", "鞍山", "抚顺", "本溪", "丹东", "锦州", "营口", "阜新", "辽阳", "盘锦", "铁岭", "朝阳", "葫芦岛"},
                {"长春", "吉林", "四平", "辽源", "通化", "白山", "松原", "白城", "延边"},
                {"哈尔滨", "齐齐哈尔", "牡丹江", "佳木斯", "大庆", "绥化", "鹤岗", "鸡西", "黑河", "双鸭山", "伊春", "七台河", "大兴安岭"},
                {"南京", "镇江", "苏州", "南通", "扬州", "盐城", "徐州", "连云港", "常州", "无锡", "宿迁", "泰州", "淮安"},
                {"杭州", "宁波", "温州", "嘉兴", "湖州", "绍兴", "金华","衢州", "舟山", "台州", "丽水"},
                {"合肥", "芜湖", "蚌埠", "马鞍山", "淮北", "铜陵", "安庆", "黄山", "滁州","宿州", "池州", "淮南", "巢湖","阜阳", "六安", "宣城", "亳州"},
                {"福州", "厦门", "莆田", "三明", "泉州", "漳州", "南平", "龙岩", "宁德"},
                {"南昌市", "景德镇", "九江", "鹰潭", "萍乡", "新馀", "赣州", "吉安", "宜春", "抚州", "上饶"},
                {"济南", "青岛", "淄博", "枣庄", "东营", "烟台", "潍坊", "济宁", "泰安", "威海", "日照", "莱芜", "临沂", "德州", "聊城", "滨州", "菏泽", "博兴"},
                {"郑州", "开封", "洛阳", "平顶山", "安阳", "鹤壁", "新乡", "焦作", "濮阳", "许昌", "漯河", "三门峡", "南阳", "商丘", "信阳", "周口", "驻马店", "济源"},
                {"武汉", "宜昌", "荆州", "襄樊", "黄石", "荆门", "黄冈", "十堰", "恩施", "潜江", "天门", "仙桃", "随州", "咸宁", "孝感", "鄂州"},
                {"长沙", "常德", "株洲", "湘潭", "衡阳", "岳阳", "邵阳", "益阳", "娄底", "怀化", "郴州", "永州", "湘西", "张家界"},
                {"广州", "深圳", "珠海", "汕头", "东莞", "中山", "佛山", "韶关", "江门", "湛江", "茂名", "肇庆", "惠州", "梅州", "汕尾", "河源", "阳江", "清远", "潮州", "揭阳", "云浮"},
                {"南宁", "柳州", "桂林", "梧州", "北海", "防城港", "钦州", "贵港", "玉林", "南宁地区", "柳州地区", "贺州", "百色", "河池"},
                {"海口", "三亚"},
                {"成都", "绵阳", "德阳", "自贡", "攀枝花", "广元", "内江", "乐山", "南充", "宜宾", "广安", "达川", "雅安", "眉山", "甘孜", "凉山", "泸州"},
                {"贵阳","六盘水", "遵义", "安顺", "铜仁", "黔西南", "毕节", "黔东南", "黔南"},
                {"昆明", "大理", "曲靖", "玉溪", "昭通", "楚雄", "红河", "文山", "思茅", "西双版纳", "保山", "德宏", "丽江", "怒江", "迪庆", "临沧"},
                {"拉萨", "日喀则", "山南", "林芝", "昌都", "阿里", "那曲"},
                {"西安", "宝鸡", "咸阳", "铜川", "渭南", "延安", "榆林", "汉中", "安康", "商洛"},
                {"兰州", "嘉峪关", "金昌", "白银", "天水", "酒泉", "张掖", "武威", "定西", "陇南", "平凉", "庆阳", "临夏", "甘南"},
                {"银川", "石嘴山", "吴忠", "固原"},
                {"西宁", "海东", "海南","海北", "黄南", "玉树", "果洛", "海西"},
                {"乌鲁木齐", "石河子", "克拉玛依", "伊犁", "巴音郭勒", "昌吉", "克孜勒苏柯尔克孜", "博 尔塔拉", "吐鲁番", "哈密", "喀什", "和田", "阿克苏"}
        };
        /*
         * 设置用户SESSION
        */
        public static void setSession(String val){
                AppConfig.SERVICE_SESSION = val;
        }
        /*
         * 获取用户SESSION
        */
        public static String getSession(){
                return AppConfig.SERVICE_SESSION;
        }
        /*
         * 设置用户登陆状态
        */
        public static void setLandingState(Boolean b){
                AppConfig.USER_WHETHER_LANDING = b;
        }
        /*
        * 获取用户登陆状态
        */
        public static Boolean getLandingState(){
                return AppConfig.USER_WHETHER_LANDING;
        }
}
